Autodesk.Revit.DB.Floor.GetSlabShapeEditor
Gets a SlabShapeEditor that can be used to add or modify points of this Floor.
Returns:
The SlabShapeEditor object

Autodesk.Revit.DB.Floor.GetDefaultFloorType(Autodesk.Revit.DB.Document,System.Boolean)
Returns id of default floor type.
document:
The document.
isFoundation:
True to return id of foundation floor type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Floor.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of architectural floor within the project.
Remarks:
To validate curve loop profile use Autodesk.Revit.DB.BoundaryValidation.
To get default floor type use Autodesk.Revit.DB.Floor.GetDefaultFloorType(Autodesk.Revit.DB.Document,System.Boolean).
document:
The document in which the new floor is created.
profile:
An array of planar curve loops that represent the profile of the floor.
floorTypeId:
Id of the floor type to be used by the new Floor.
levelId:
Id of the level on which the floor is to be placed.
Returns:
If successful a new floor object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId levelId is not a Level.
-or-
The floorTypeId does not correspond to a FloorType.
-or-
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
-or-
Input curves build invalid sketch.
-or-
Failed to create curve elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot generate a sketch.
-or-
Failed to create new element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022

Autodesk.Revit.DB.Floor.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean,Autodesk.Revit.DB.Line,System.Double)
Creates a new instance of floor within the project.
Remarks:
To validate curve loop profile use Autodesk.Revit.DB.BoundaryValidation.
To get default floor type use Autodesk.Revit.DB.Floor.GetDefaultFloorType(Autodesk.Revit.DB.Document,System.Boolean).
document:
The document in which the new floor is created.
profile:
An array of planar curve loops that represent the profile of the floor.
floorTypeId:
Id of the floor type to be used by the new Floor.
levelId:
Id of the level on which the floor is to be placed.
isStructural:
True if new floor should be structural, false if architectural.
slopeArrow:
A line used to control the slope angle of the Floor. It must be horizontal.
If slopeArrow is null, the horizontal floor will be created.
slope:
The slope angle. If slopeArrow is null, this parameter will be ignored.
Returns:
If successful a new floor object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId levelId is not a Level.
-or-
The floorTypeId does not correspond to a FloorType.
-or-
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
-or-
The slopeArrow must be a horizontal line.
-or-
Input curves build invalid sketch.
-or-
Failed to create curve elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot generate a sketch.
-or-
Failed to create new element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022

Autodesk.Revit.DB.Floor.SketchId
Returns id of the sketch.
Since:
2022

Autodesk.Revit.DB.Floor.SpanDirectionAngle
Retrieve the span direction angle of the floor.
Remarks:
The angle returned is in radians. An exception will be thrown if the floor is non structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:

Autodesk.Revit.DB.Floor.FloorType
Retrieves/sets an object that represents the type of the floor.
Remarks:
The floor type can be used to access the multi layered structure of a floor.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Floor type is not valid for this floor.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.Floor
An object that represents a Floor within the Autodesk Revit project.
Remarks:
This object derived from the Element base object and such supports all the
methods of that object such as the ability to retrieve the parameters of that object.